{
  "backend/main.mo": "Motoko canister implementing access-controlled user profiles, settings, and per-user trade storage with Map-based persistence and authorization mixins.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test references for auditing development changes.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend files, including mappers, utilities, components, pages, and hooks involved in strategy preset logic.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables, theme tokens, and light/dark mode base styles.",
  "frontend/index.html": "HTML entry point loading the React app root element and main TypeScript bundle.",
  "frontend/src/App.tsx": "Main app router and layout configuration handling authentication, user profile gating, theming, and navigation structure.",
  "frontend/src/components/auth/LoginView.tsx": "Login screen using Internet Identity with styled card UI and loading feedback.",
  "frontend/src/components/auth/UserProfileSetupModal.tsx": "Modal prompting new authenticated users to submit a name and create their profile with validation and mutation handling.",
  "frontend/src/components/charts/EquityCurveChart.tsx": "Recharts line chart component rendering equity balance history with formatted axes and theming.",
  "frontend/src/components/charts/MonthlyPerformanceChart.tsx": "Recharts bar chart displaying monthly pip performance with color-coded profit/loss bars and formatted tooltips.",
  "frontend/src/components/charts/PairDistributionChart.tsx": "Renders a pie chart of trade counts per pair using Recharts, with custom colors and labels.",
  "frontend/src/components/charts/SessionPerformanceChart.tsx": "Displays session-based bar charts for trades and win rate, including grid, legend, and formatted tooltips.",
  "frontend/src/components/chat/ChatPanel.tsx": "Provides a chat UI where users query trading metrics and receive rule‑based bot responses.",
  "frontend/src/components/dashboard/KpiGrid.tsx": "Shows a grid of key trading metrics with icons, colors, and formatted values.",
  "frontend/src/components/journal/TradeFormDialog.tsx": "Dialog for creating or editing trades, loading presets, syncing settings, and validating checklist items before saving.",
  "frontend/src/components/journal/TradesTable.tsx": "Renders a sortable trade table with status, discipline indicators, and edit/delete actions.",
  "frontend/src/components/shell/AppLayout.tsx": "Layout wrapper with top bar, side navigation, and main content area.",
  "frontend/src/components/shell/SideNav.tsx": "Vertical navigation menu highlighting active routes and linking to main sections.",
  "frontend/src/components/shell/TopBar.tsx": "Top header showing branding, user profile info, and logout handling.",
  "frontend/src/components/tools/CompoundingGrowthSimulator.tsx": "Interactive compound growth tool with inputs for balance, return, and months, displaying results and a line chart.",
  "frontend/src/components/tools/DrawdownRecoveryCalculator.tsx": "Calculates required return to recover from a drawdown and displays the value with a warning section.",
  "frontend/src/components/tools/LotSizeCalculator.tsx": "Computes risk amount, stop distance, and lot size from trading inputs, using settings defaults when available.",
  "frontend/src/components/tools/PipCalculator.tsx": "Computes price distance and pip count from entry, exit, and pip value inputs.",
  "frontend/src/components/tools/RiskOfRuinCalculator.tsx": "Estimates risk of ruin based on win rate, average win/loss, and risk per trade, with risk assessment messaging.",
  "frontend/src/components/tools/RiskPercentCalculator.tsx": "Calculates risk percentage from account size and risk amount using settings defaults.",
  "frontend/src/domain/mappers.ts": "Maps backend trade data to UI format and converts form data into a Trade object with calculated risk and violations.",
  "frontend/src/domain/types.ts": "Defines TypeScript types for trades, forms, metrics, equity points, and performance distributions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, stored identities, and auth-client state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, trades, and settings via the backend actor.",
  "frontend/src/index.css": "Configures Tailwind base styles and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/DashboardPage.tsx": "Displays trading KPIs and charts using trade data, with loading skeletons and tabbed analytics views.",
  "frontend/src/pages/JournalPage.tsx": "Shows searchable trade history with CSV export, edit/delete actions, and a trade entry form dialog.",
  "frontend/src/pages/SettingsPage.tsx": "A settings page that loads user preferences, displays a form, and saves updated settings via API hooks.",
  "frontend/src/pages/ToolsPage.tsx": "Provides a tabbed interface for multiple trading calculators like lot size, risk percent, pip, and drawdown tools.",
  "frontend/src/utils/analytics.ts": "Computes comprehensive performance metrics, equity curves, drawdowns, streaks, and risk consistency from trade data.",
  "frontend/src/utils/breakdowns.ts": "Generates monthly, pair-based, and session-based performance breakdowns from trades.",
  "frontend/src/utils/chatbotRules.ts": "Maps user queries to responses using trading performance metrics for a stats-focused chatbot.",
  "frontend/src/utils/csvExport.ts": "Converts trades to CSV format and triggers browser downloads.",
  "frontend/src/utils/format.ts": "Utility functions for formatting currency, percentages, numbers, and dates.",
  "frontend/src/utils/strategyPresets.ts": "Parses and deduplicates newline-delimited strategy preset text into a clean list.",
  "frontend/src/utils/toolsMath.ts": "Provides math utilities for risk percent, compounding growth, drawdown recovery, and risk of ruin.",
  "frontend/src/utils/tradingCalculations.ts": "Contains trading-related calculations such as risk amount, stop distance, lot size, R/R, profit/loss, and pip value.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters (including hash routing) and persisting them in sessionStorage, plus helpers for clearing stored or hash parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS config defining dark mode, content paths, custom color system, extended theme settings, animations, and plugin usage.",
  "project_state.json": "Project state file describing app goals, architecture notes, implemented features, and metadata for build planning."
}