{
  "backend/main.mo": "Motoko canister defining trades, settings, user profiles, authorization checks, and CRUD operations with storage mixins.",
  "feature_evidence.json": "Feature evidence describing frontend retry/backoff improvements for backend-unavailable startup scenarios and listing affected files/components.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend source files covering mappers, UI components, hooks, and pages.",
  "frontend/index.css": "Tailwind base theme file defining OKLCH color tokens for light/dark modes and global CSS variables.",
  "frontend/index.html": "HTML entry point loading the React app, manifest, icons, and II_URL environment config.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, theme colors, and startup behavior.",
  "frontend/src/App.tsx": "Root component handling identity loading, authentication gating, theming, and QueryClient setup.",
  "frontend/src/app/AuthenticatedApp.tsx": "Authenticated shell running startup initialization with retry/backoff, error handling, and profile setup flow.",
  "frontend/src/app/queryClient.ts": "Creates and configures a global React Query client with default caching and retry policies.",
  "frontend/src/app/router.tsx": "Defines application routes for Dashboard, Journal, Tools, Settings, and About using TanStack Router.",
  "frontend/src/components/auth/LoginBranding.tsx": "Login branding component rendering the logo with a text fallback if the image fails to load.",
  "frontend/src/components/auth/LoginView.tsx": "Login page using Internet Identity with loading, error handling, and styled UI components.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for first‑time user name entry with validation, error display, and save handling.",
  "frontend/src/components/auth/UserProfileSetupModal.tsx": "Always‑open modal for creating a user profile name using a mutation hook and toast feedback.",
  "frontend/src/components/charts/EquityCurveChart.tsx": "Responsive line chart rendering equity balance over time with formatted axes and tooltips.",
  "frontend/src/components/charts/MonthlyPerformanceChart.tsx": "Bar chart visualizing monthly profit in pips with positive/negative color coding.",
  "frontend/src/components/charts/PairDistributionChart.tsx": "Pie chart showing trade distribution per currency pair with labeled segments and legend.",
  "frontend/src/components/charts/SessionPerformanceChart.tsx": "Bar chart comparing trade count and win rate across trading sessions with legend and tooltips.",
  "frontend/src/components/chat/ChatPanel.tsx": "Interactive chat interface letting users query trading metrics through predefined chatbot rules.",
  "frontend/src/components/dashboard/AnalyticsSummaryPanel.tsx": "Dashboard panel summarizing key performance metrics with safe numeric formatting and indicators.",
  "frontend/src/components/dashboard/KpiGrid.tsx": "Displays a grid of KPI cards using formatted performance metrics with icons and color coding.",
  "frontend/src/components/journal/TradeFormDialog.tsx": "A full trade-entry dialog handling create/edit mode, validation, preset loading, and form state population.",
  "frontend/src/components/journal/TradesTable.tsx": "Renders a trades table with formatting, discipline indicators, and edit/delete actions with loading and empty states.",
  "frontend/src/components/settings/StartFreshSection.tsx": "Provides a danger-zone UI allowing users to wipe all data, clear cache, and reload the app after confirmation.",
  "frontend/src/components/shell/AppLayout.tsx": "Defines the main app layout with top bar, side nav, routed content area, and branded footer.",
  "frontend/src/components/shell/MobileNav.tsx": "Implements a mobile slide-out navigation menu with branding, active-state styling, and route navigation.",
  "frontend/src/components/shell/SideNav.tsx": "Static side navigation for large screens with active highlighting and route navigation.",
  "frontend/src/components/shell/TopBar.tsx": "Top bar with branding, mobile nav trigger, user avatar, profile dropdown, and logout handling.",
  "frontend/src/components/startup/AppErrorBoundary.tsx": "React error boundary that catches runtime errors and displays a recovery screen with reload support.",
  "frontend/src/components/startup/StartupErrorScreen.tsx": "Full‑screen startup error UI with optional technical details and async retry handling.",
  "frontend/src/components/tools/CompoundingGrowthSimulator.tsx": "Simulates compound account growth based on user inputs and displays results with a line chart.",
  "frontend/src/components/tools/DrawdownRecoveryCalculator.tsx": "Calculates the required return to recover from a drawdown and displays explanatory output.",
  "frontend/src/components/tools/LotSizeCalculator.tsx": "Computes forex lot size using risk, stop distance, and pip value with live inputs.",
  "frontend/src/components/tools/PipCalculator.tsx": "Computes pip distance between two prices and shows price movement in pips.",
  "frontend/src/components/tools/RiskOfRuinCalculator.tsx": "Estimates probability of account ruin using win rate, average win/loss, and risk per trade.",
  "frontend/src/components/tools/RiskPercentCalculator.tsx": "React UI tool that computes risk percent from account size and risk amount using settings defaults and displays formatted output.",
  "frontend/src/constants/branding.ts": "Centralized constants defining app branding assets, icons, name, and tagline.",
  "frontend/src/domain/mappers.ts": "Maps trade form data into a backend Trade object, computing risk, RR, violations, and normalized profit/loss values.",
  "frontend/src/domain/types.ts": "Type definitions for trades, form data, performance metrics, and related domain models.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to authenticated identity, refetching dependent queries on change.",
  "frontend/src/hooks/useActorWithOptionalAdminInit.ts": "Empty file.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading/storing identity and exposing login, clear, and status helpers.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for profile, trades, settings, and reset operations using safe actor access and cache invalidation.",
  "frontend/src/hooks/useSafeActor.ts": "Safe backend actor hook with timeouts, retries, admin init handling, and query invalidation behavior.",
  "frontend/src/hooks/useStartupGate.ts": "Implements a startup state machine that coordinates actor initialization and profile loading with timeout and retry logic.",
  "frontend/src/hooks/useStrategyPresets.ts": "Parses and memoizes strategy presets from settings, exposing the preset list and a boolean flag.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for theming across dark, light, and unauthenticated modes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with branding, creator story, and principle cards.",
  "frontend/src/pages/DashboardPage.tsx": "Displays trading KPIs, charts, summaries, and chat panel with loading and empty-state handling.",
  "frontend/src/pages/JournalPage.tsx": "Provides the trading journal UI with search, CRUD actions, CSV export, and trade form dialog.",
  "frontend/src/pages/SettingsPage.tsx": "Renders the settings UI, loads and edits user settings, and saves updates using backend queries.",
  "frontend/src/pages/ToolsPage.tsx": "Provides a tabbed interface for selecting and displaying various trading calculators.",
  "frontend/src/utils/analytics.ts": "Computes performance metrics, equity curves, drawdowns, and related analytics from trade data.",
  "frontend/src/utils/breakdowns.ts": "Generates monthly, pair-based, and session-based performance breakdowns from trades.",
  "frontend/src/utils/chatbotRules.ts": "Parses user queries and returns chatbot responses based on performance metrics.",
  "frontend/src/utils/csvExport.ts": "Creates CSV exports of trades and triggers file download with proper formatting and escaping.",
  "frontend/src/utils/format.ts": "Contains safe formatting helpers for currency, numbers, percentages, ratios, and dates.",
  "frontend/src/utils/getErrorMessage.ts": "Extracts readable error messages from various error shapes, including nested and backend errors.",
  "frontend/src/utils/icRejectParsing.ts": "Provides helpers to parse IC reject errors into readable messages and detect backend-unavailable conditions.",
  "frontend/src/utils/startupErrorClassification.ts": "Classifies startup errors into categories and builds user-facing error details using parsed IC error info.",
  "frontend/src/utils/strategyPresets.ts": "Parses newline-delimited strategy preset text into a trimmed, deduplicated list.",
  "frontend/src/utils/toolsMath.ts": "Contains math utilities for trading analytics like risk percent, compound growth, drawdown recovery, and risk of ruin.",
  "frontend/src/utils/tradingCalculations.ts": "Implements core trading calculations including risk, lot size, RR, P/L, percent change, and pip value.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, persisting, and clearing URL parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, and plugins for the frontend.",
  "project_state.json": "Tracks project state, issues, and feature requests related to backend canister reliability and startup behavior."
}