{
  "backend/main.mo": "Motoko actor managing user profiles, trades, and settings with access control and storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend source files.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light/dark modes using OKLCH color tokens.",
  "frontend/index.html": "HTML entrypoint defining metadata, favicons, II URL, and bootstrapping the React app.",
  "frontend/public/manifest.webmanifest": "Web App Manifest configuring PWA metadata, icons, colors, and start behavior.",
  "frontend/src/App.tsx": "Root React component handling identity init, routing to login or authenticated app, and query client setup.",
  "frontend/src/app/AuthenticatedApp.tsx": "Authenticated shell running startup gate logic with loading, error, setup, and ready states.",
  "frontend/src/app/queryClient.ts": "Creates a configured React Query client with shared caching and retry defaults.",
  "frontend/src/app/router.tsx": "Defines all application routes using TanStack Router with AppLayout as root.",
  "frontend/src/components/auth/LoginBranding.tsx": "Login branding component showing resilient logo with fallback text if image fails.",
  "frontend/src/components/auth/LoginView.tsx": "Login screen handling Internet Identity auth with loading, error states, and branding.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal for first‑time users to enter and save their name with validation and error handling.",
  "frontend/src/components/auth/UserProfileSetupModal.tsx": "Always‑open profile setup modal allowing users to submit their name via a mutation with toast feedback.",
  "frontend/src/components/charts/EquityCurveChart.tsx": "Responsive line chart showing equity over time with formatted dates and currency.",
  "frontend/src/components/charts/MonthlyPerformanceChart.tsx": "Bar chart visualizing monthly profit in pips with color‑coded gains and losses.",
  "frontend/src/components/charts/PairDistributionChart.tsx": "Pie chart displaying trade distribution by currency pair with labeled segments.",
  "frontend/src/components/charts/SessionPerformanceChart.tsx": "Bar chart comparing trades and win rate across trading sessions.",
  "frontend/src/components/chat/ChatPanel.tsx": "Interactive chat UI allowing users to ask performance questions and receive rule‑based bot replies.",
  "frontend/src/components/dashboard/AnalyticsSummaryPanel.tsx": "Summary panel presenting key performance metrics with formatted KPIs and categorized sections.",
  "frontend/src/components/dashboard/KpiGrid.tsx": "Displays a grid of KPI cards derived from performance metrics with safe number formatting and icons.",
  "frontend/src/components/journal/TradeFormDialog.tsx": "Provides a full trade entry/edit dialog with presets, validation, and discipline fields, syncing form state with existing trades and settings.",
  "frontend/src/components/journal/TradesTable.tsx": "Renders a sortable trade list with badges, discipline indicators, and edit/delete actions, including loading and empty states.",
  "frontend/src/components/settings/StartFreshSection.tsx": "Implements a danger-zone reset flow that confirms, clears all user data, resets cache, and reloads the app.",
  "frontend/src/components/shell/AppLayout.tsx": "Defines the app’s main layout with top bar, side navigation, routed content area, and footer branding.",
  "frontend/src/components/shell/MobileNav.tsx": "Provides a mobile slide-out navigation menu with branding and route-aware highlighting.",
  "frontend/src/components/shell/SideNav.tsx": "Renders the desktop sidebar navigation with active-state styling and route navigation.",
  "frontend/src/components/shell/TopBar.tsx": "Shows the top navigation bar with branding, mobile nav trigger, user avatar menu, and logout handling.",
  "frontend/src/components/startup/AppErrorBoundary.tsx": "React error boundary that catches runtime errors and displays a reload screen instead of crashing the app.",
  "frontend/src/components/startup/StartupErrorScreen.tsx": "Full‑screen startup error UI with optional details and a retry mechanism.",
  "frontend/src/components/tools/CompoundingGrowthSimulator.tsx": "Interactive tool that simulates compound growth over time and visualizes results with a line chart.",
  "frontend/src/components/tools/DrawdownRecoveryCalculator.tsx": "Calculator that determines the return required to recover from a given drawdown percentage.",
  "frontend/src/components/tools/LotSizeCalculator.tsx": "Trading tool that computes lot size based on account size, risk, stop distance, and pip value.",
  "frontend/src/components/tools/PipCalculator.tsx": "Calculates price distance and pip count between two prices using a pip value.",
  "frontend/src/components/tools/RiskOfRuinCalculator.tsx": "Estimates probability of ruin based on win rate, average win/loss, and risk per trade.",
  "frontend/src/components/tools/RiskPercentCalculator.tsx": "React component that calculates and displays risk percentage based on account size and risk amount.",
  "frontend/src/constants/branding.ts": "Defines centralized branding constants for logos, icons, and app metadata.",
  "frontend/src/domain/mappers.ts": "Maps trade form data into a backend Trade object with risk calculations, violations, and normalized fields.",
  "frontend/src/domain/types.ts": "Contains TypeScript types for trades, metrics, sessions, and form data used throughout the domain layer.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates queries when it changes.",
  "frontend/src/hooks/useActorWithOptionalAdminInit.ts": "Empty file.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, login handling, and identity persistence using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating trades, settings, and user profiles using a safe actor.",
  "frontend/src/hooks/useSafeActor.ts": "Creates a backend actor with timeout, retry logic, optional admin initialization, and robust error handling.",
  "frontend/src/hooks/useStartupGate.ts": "Controls app startup flow by coordinating actor and profile loading with timeout and error-based status states.",
  "frontend/src/hooks/useStrategyPresets.ts": "Provides a memoized hook that parses strategy presets from settings and exposes the preset list with a flag indicating if any exist.",
  "frontend/src/index.css": "Defines Tailwind setup and theme variables for light, dark, and root styles, including color tokens and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity context, applying global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders an about page with branding, story sections, and principle cards using styled UI components.",
  "frontend/src/pages/DashboardPage.tsx": "Displays analytics, KPIs, charts, and chat based on trade data, handling loading and empty states.",
  "frontend/src/pages/JournalPage.tsx": "Implements the trading journal with search, CSV export, trade table, and trade creation/editing dialog.",
  "frontend/src/pages/SettingsPage.tsx": "Provides settings management for trading defaults, strategy presets, and saving via actor-backed API.",
  "frontend/src/pages/ToolsPage.tsx": "Renders a tools page with tabs and a mobile dropdown to switch between six calculator components. Manages synchronized tool selection state across UI layouts.",
  "frontend/src/utils/analytics.ts": "Computes detailed trading performance metrics and equity curves from trade data, including drawdown, expectancy, profit factor, and streaks. Also provides helpers for equity curve and max drawdown calculations.",
  "frontend/src/utils/breakdowns.ts": "Generates monthly performance, pair distribution, and session-based statistics from trade data. Groups and aggregates trades by date, pair, and trading session.",
  "frontend/src/utils/chatbotRules.ts": "Maps user queries to responses based on performance metrics, answering common stat-related questions. Supports win rate, profit, streaks, drawdown, and general help prompts.",
  "frontend/src/utils/csvExport.ts": "Creates a CSV export of trades with formatted fields and provides a browser download helper. Handles escaping CSV fields and producing rows from trade objects.",
  "frontend/src/utils/format.ts": "Offers safe formatters for currency, percentages, numbers, ratios, and dates. Handles NaN, Infinity, and bigint timestamps gracefully.",
  "frontend/src/utils/getErrorMessage.ts": "Extracts readable error messages from unknown error shapes, including nested causes and backend trap formats. Falls back to JSON or generic messages when needed.",
  "frontend/src/utils/startupErrorClassification.ts": "Classifies startup errors into standardized categories like connection, authorization, timeout, or profile issues. Returns metadata for UI display including titles and descriptions.",
  "frontend/src/utils/strategyPresets.ts": "Parses newline-delimited strategy presets into a trimmed, deduplicated list. Removes empty lines and preserves case-sensitive uniqueness.",
  "frontend/src/utils/toolsMath.ts": "Implements math utilities for risk percent, compounding growth, drawdown recovery, and risk of ruin calculations. Provides simple financial formulas used by the tools page.",
  "frontend/src/utils/tradingCalculations.ts": "Provides helper functions for risk, lot size, reward‑risk, profit/loss, percent gain/loss, and pip value calculations for trading operations.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL and session parameters, including support for hash‑based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores the project’s current state, including rebuild goals, known issues, and feature requests centered on fixing initialization hangs and improving startup behavior."
}