{
  "backend/main.mo": "Motoko canister implementing access-controlled user profiles and per-user trade storage with save and query operations.",
  "feature_evidence.json": "Report linking implemented features to corresponding frontend files, components, and requirement IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purpose of selected frontend domain and styling files.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color tokens and dark/light themes for the app’s black‑and‑gold design.",
  "frontend/index.html": "Base HTML entrypoint loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Sets up Internet Identity‑gated routing, profile setup flow, and app layout using TanStack Router and ThemeProvider.",
  "frontend/src/components/auth/LoginView.tsx": "Login screen that initiates Internet Identity authentication and displays branding.",
  "frontend/src/components/auth/UserProfileSetupModal.tsx": "Modal prompting new authenticated users to create their profile and saving it via backend mutation.",
  "frontend/src/components/charts/EquityCurveChart.tsx": "Renders a line chart of equity balance over time using Recharts and formatting utilities.",
  "frontend/src/components/charts/MonthlyPerformanceChart.tsx": "Renders a bar chart showing monthly pip performance with color-coded profit/loss.",
  "frontend/src/components/charts/PairDistributionChart.tsx": "Renders a pie chart summarizing trade distribution across currency pairs using themed colors.",
  "frontend/src/components/charts/SessionPerformanceChart.tsx": "Renders a bar chart of session performance using Recharts, showing trades and win rate or a placeholder if no data.",
  "frontend/src/components/chat/ChatPanel.tsx": "Provides a chatbot UI for querying performance metrics, managing message history and user input.",
  "frontend/src/components/dashboard/KpiGrid.tsx": "Displays key performance metrics in a grid of KPI cards with icons and formatted values.",
  "frontend/src/components/journal/TradeFormDialog.tsx": "Dialog for creating or editing trades with form state, validation, and save logic tied to backend hooks.",
  "frontend/src/components/journal/TradesTable.tsx": "Renders a table of trades with formatting, discipline indicators, and edit/delete actions.",
  "frontend/src/components/shell/AppLayout.tsx": "Layout component providing top bar, side nav, and main content structure.",
  "frontend/src/components/shell/SideNav.tsx": "Sidebar navigation listing main app routes with active highlighting and footer attribution.",
  "frontend/src/components/shell/TopBar.tsx": "Top navigation bar showing branding, user profile info, and logout functionality.",
  "frontend/src/components/tools/CompoundingGrowthSimulator.tsx": "Interactive tool that calculates and charts compound growth based on initial balance, monthly return, and duration.",
  "frontend/src/components/tools/DrawdownRecoveryCalculator.tsx": "Computes the percentage return needed to recover from a given drawdown with user input.",
  "frontend/src/components/tools/LotSizeCalculator.tsx": "Calculates lot size, risk amount, and stop distance using trading inputs and optional default settings.",
  "frontend/src/components/tools/PipCalculator.tsx": "Determines pip distance and price difference between two prices based on pip value.",
  "frontend/src/components/tools/RiskOfRuinCalculator.tsx": "Estimates probability of account ruin using win rate, average win/loss, and risk per trade.",
  "frontend/src/components/tools/RiskPercentCalculator.tsx": "Computes risk percentage from account size and dollar risk amount.",
  "frontend/src/domain/mappers.ts": "Maps backend trade data to UI format and converts form data into a backend Trade object with validation and violations.",
  "frontend/src/domain/types.ts": "Defines TypeScript types for trades, form data, performance metrics, and related domain entities.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout functions, and loads persisted identities via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls for profiles, trades, and settings with React Query hooks including mutations and invalidation.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light, dark, and base themes.",
  "frontend/src/main.tsx": "Bootstraps the app with React, QueryClientProvider, and InternetIdentityProvider.",
  "frontend/src/pages/DashboardPage.tsx": "Displays performance metrics, charts, and trade analytics using fetched trades.",
  "frontend/src/pages/JournalPage.tsx": "Shows a searchable trades table with create, edit, delete, and CSV export features.",
  "frontend/src/pages/SettingsPage.tsx": "React page that loads, edits, and saves user trading settings including defaults, theme, and strategy presets.",
  "frontend/src/pages/ToolsPage.tsx": "Page displaying multiple trading calculators via tabbed components for risk and position management.",
  "frontend/src/utils/analytics.ts": "Functions to compute trading performance metrics, equity curve, drawdown, streaks, and risk consistency.",
  "frontend/src/utils/breakdowns.ts": "Generates monthly, pair-based, and session-based performance breakdowns from trade data.",
  "frontend/src/utils/chatbotRules.ts": "Maps user chatbot queries to responses using performance metrics such as win rate, profit, and streaks.",
  "frontend/src/utils/csvExport.ts": "Builds CSV export of trades and provides a browser download helper.",
  "frontend/src/utils/format.ts": "Utility functions for formatting dates, numbers, percentages, and currency.",
  "frontend/src/utils/toolsMath.ts": "Math helpers powering trading tools including risk percent, compounding, drawdown recovery, and risk of ruin.",
  "frontend/src/utils/tradingCalculations.ts": "Core trading calculations including risk amount, stop distance, lot size, RR, P/L, percent gain, and pip value.",
  "frontend/src/utils/urlParams.ts": "Utility for reading URL parameters, persisting them in sessionStorage, and optionally removing them from the hash.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, custom colors, animations, and plugin setup.",
  "project_state.json": "JSON describing the project’s state, goals, architecture notes, features, and image requirements."
}