{
  "kind": "build_request",
  "title": "Wire Settings Strategy Presets into Journal New Trade Strategy dropdown",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-15",
      "text": "Update the Journal New Trade form so the Strategy dropdown options are sourced exclusively from the authenticated user’s saved Settings → Strategy Presets (persisted after the user clicks Save Settings), instead of a hardcoded list.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8",
          "msg-12"
        ],
        "quotes": [
          "connect the setting presets to this so if we type \"order block\" in setting and in strategy preset i need this to appear in journal inside the strategy selection",
          "1.user saved presets only",
          "its only through setting and hit save to save it and it will appear in journal inside new trades inside strategies name in dropdown"
        ]
      },
      "acceptanceCriteria": [
        "After saving Settings with strategy presets (e.g., lines: \"Order Block\"), opening Journal → New Trade shows \"Order Block\" as a selectable Strategy option.",
        "The Strategy dropdown in the New Trade form does not display any hardcoded strategies (e.g., no default list like “Structure Break”, “Other”, etc.) when presets exist; it only displays the saved presets.",
        "Editing an existing trade still shows the trade’s saved strategy value selected in the Strategy field, even if it is not currently present in presets (no crash)."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Parse Settings.strategyPresets (stored as a newline-delimited string) into a clean list for the Strategy dropdown by trimming whitespace, removing empty lines, and de-duplicating identical entries (case-sensitive or case-insensitive must be consistent within the app).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-12"
        ],
        "quotes": [
          "connect the setting presets to this",
          "hit save to save it and it will appear in journal inside new trades inside strategies name in dropdown"
        ]
      },
      "acceptanceCriteria": [
        "Given a strategy presets textarea value containing blank lines and extra spaces, the New Trade Strategy dropdown shows only non-empty trimmed items.",
        "Duplicate presets do not render duplicate Strategy options in the dropdown."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Adjust frontend domain typing so TradeFormData.strategy can support dynamic preset values loaded from Settings (rather than a fixed TypeScript union of hardcoded strategy strings).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-12"
        ],
        "quotes": [
          "strategy preset i need this to appear in journal inside the strategy selection",
          "it will appear in journal inside new trades inside strategies name in dropdown"
        ]
      },
      "acceptanceCriteria": [
        "The frontend builds without TypeScript errors after making Strategy presets dynamic.",
        "Saving a trade with a preset strategy stores the selected strategy value into the trade’s entryType field (via existing mapping) and it appears in the Journal table/search as before."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Handle the empty-presets state in the New Trade form: if Settings has no strategy presets saved (empty list), the Strategy field must make it clear the user needs to add presets in Settings and must prevent selecting arbitrary strategies from the Journal.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10",
          "msg-12"
        ],
        "quotes": [
          "Strategy names should be created only in Settings",
          "its only through setting"
        ]
      },
      "acceptanceCriteria": [
        "If the saved strategy preset list is empty, the New Trade form does not offer any Strategy options and indicates the user should add strategies in Settings (user-facing text must be in English).",
        "Users cannot create/add a new strategy from the Journal form; strategies remain managed only via Settings."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui; compose existing UI components instead.",
    "Keep the backend single-actor architecture (all Motoko logic in backend/main.mo); only introduce migration code if a state schema change is required."
  ],
  "nonGoals": [
    "Adding the ability to create or edit strategy presets from the Journal page.",
    "Introducing additional strategy metadata (colors, performance rules, tags) beyond the existing preset names.",
    "Changing the backend Settings schema (it already includes strategyPresets as Text)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}