{
  "kind": "build_request",
  "title": "Rebuild startup flow to eliminate infinite “Initializing…” screen",
  "projectName": "Nurox",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Eliminate the infinite initializing/loading screen by removing any blocking startup work from the actor creation path (e.g., admin access-control initialization) so the app can always render Login or the authenticated UI without hanging.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "its not loading see the screenshot",
          "search everything that related the intializing page and fix the loading bug",
          "just rebuild the website again with new code fully rebuild the website from scratch and with no bugs",
          "build"
        ]
      },
      "acceptanceCriteria": [
        "When loading the app in a fresh browser session, the UI reaches either the Login screen or the authenticated app shell within 5 seconds on a normal connection (no indefinite spinner).",
        "Actor initialization does not block on optional admin-only initialization when no admin token is provided.",
        "If actor initialization fails, the app shows an error state with a recovery action (retry/reload) instead of remaining stuck on “Initializing…” indefinitely."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement a new non-blocking actor hook (e.g., `useSafeActor`) that replaces usage of the immutable `useActor` hook across the app, ensuring actor creation succeeds for normal users and admin initialization is attempted only when an admin token is present and can fail safely without blocking.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "search everything that related the intializing page and fix the loading bug"
        ]
      },
      "acceptanceCriteria": [
        "A new hook is added (not by editing `frontend/src/hooks/useActor.ts`) that creates the backend actor for anonymous and authenticated identities.",
        "Any admin-only initialization is gated (only runs when the `caffeineAdminToken` parameter is present and non-empty) and failures are caught and surfaced non-blockingly (e.g., warning state), not causing the actor promise to hang.",
        "All queries/mutations that previously depended on `useActor()` are updated to use the new hook so the app does not indirectly call the immutable `useActor` at runtime."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the authenticated startup gate so it cannot display “Initializing…” forever: add a timeout and show a clear English error screen that includes the most relevant failure reason (actor init vs profile load) and provides a Retry action that re-attempts initialization without requiring a hard refresh.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "its not loading see the screenshot"
        ]
      },
      "acceptanceCriteria": [
        "If the authenticated shell is still initializing after a defined timeout (e.g., 15 seconds), it transitions to an error UI instead of continuing to show the spinner.",
        "The error UI offers a Retry action that re-triggers actor/profile loading and can recover without a full page reload.",
        "The error UI text is in English and is specific enough to guide debugging (e.g., indicates whether actor creation failed or profile fetch failed)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure the Internet Identity provider URL is reliably available at runtime as `process.env.II_URL` (exact value `https://identity.ic0.app/#authorize`) so the existing immutable Internet Identity hook can initialize consistently across rebuilds.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "fix the initializing issue"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/index.html` sets `window.process.env.II_URL` to `https://identity.ic0.app/#authorize` at runtime.",
        "Login via Internet Identity opens the correct identity provider URL in a new session.",
        "No startup code path depends on missing build-time env vars for II URL (the runtime value is sufficient)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Apply a coherent visual theme consistently across the rebuilt startup/login/initializing/error screens (dark graphite base with warm neutral surfaces and a neon-lime accent; avoid blue/purple), keeping typography and spacing consistent with the rest of the app UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "just rebuild the website again with new code fully rebuild the website from scratch and with no bugs"
        ]
      },
      "acceptanceCriteria": [
        "Login, loading, and error screens share the same visual language (colors, typography, spacing) and look intentional rather than default.",
        "Accent color usage is consistent across buttons/spinners/alerts and does not use blue/purple as the primary accent.",
        "No user-facing text regresses to non-English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend immutable paths: `frontend/src/hooks/useInternetIdentity.ts(x)`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, and any files under `frontend/src/components/ui`. Compose/replace behavior by adding new hooks/components and updating non-immutable call sites.",
    "Backend must remain a single Motoko actor in `backend/main.mo` (no new backend services)."
  ],
  "nonGoals": [
    "Adding new product features unrelated to fixing startup/loading (e.g., new dashboard modules, new calculators, new third-party integrations).",
    "Introducing non-supported auth providers (only Internet Identity is allowed).",
    "Adding external databases or non-Motoko backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}