{
  "kind": "build_request",
  "title": "Clean backend rebuild to resolve recurring canister-stopped startup/login failure",
  "projectName": "Trading Command Center",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Rebuild and redeploy the Motoko backend canister cleanly so the app no longer opens to a recurring “Backend Service Unavailable / Backend canister is stopped (Reject code: 5)” screen on initial load, and the canister responds reliably to requests after deployment.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "yeah rebuild"
        ]
      },
      "acceptanceCriteria": [
        "After deployment, calling the backend `healthCheck()` query returns `true` consistently during normal use.",
        "Opening the site no longer immediately fails due to the backend canister being stopped; the user can reach the login flow without needing repeated manual refreshes under normal conditions.",
        "If a state-breaking change is required for the clean rebuild, explicitly reset state rather than leaving the canister in a partially-initialized state."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Improve the frontend startup recovery behavior for backend-unavailable scenarios (e.g., reject code 5 / canister stopped) by adding automatic retry/backoff before showing the terminal error screen, and ensure the “Retry Connection” action fully re-initializes startup (actor + profile) without requiring a full page reload.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "i mean i cant log in into the webite when i open it immidietaly shows like this",
          "yeah rebuild"
        ]
      },
      "acceptanceCriteria": [
        "When the backend is temporarily unavailable at first load, the app attempts automatic reconnection retries (with a bounded max duration) before presenting the error screen.",
        "Clicking “Retry Connection” on the startup error screen triggers a fresh actor initialization attempt and profile refetch (no stale error state).",
        "The startup flow never remains stuck indefinitely in a loading state; it either becomes ready/setup-needed or shows a classified error within the existing timeout guarantees."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo`.",
    "Do not edit files under `frontend/src/components/ui` or other immutable paths listed in SYSTEM_CONTEXT.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Do not implement third-party authentication providers (Internet Identity remains the only auth).",
    "Do not add external databases or non-IC hosting to keep the canister running.",
    "Do not change the Settings page styling/theme as part of this rebuild request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}