{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Trading Command Center – Frontend startup retry/backoff & recovery",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Add bounded automatic retry/backoff for backend-unavailable startup and ensure Retry Connection fully reinitializes actor + profile without page reload.",
      "acceptanceCriteria": [
        "When the backend is temporarily unavailable at first load, the app attempts automatic reconnection retries (with a bounded max duration) before presenting the error screen.",
        "Clicking “Retry Connection” on the startup error screen triggers a fresh actor initialization attempt and profile refetch (no stale error state).",
        "The startup flow never remains stuck indefinitely in a loading state; it either becomes ready/setup-needed or shows a classified error within the existing timeout guarantees."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useSafeActor.ts",
          "operation": "modify",
          "description": "Implement automatic retry/backoff for actor initialization failures (especially backend-unavailable/reject code scenarios) using bounded retry attempts and delay so transient canister-startup downtime does not immediately surface as a terminal error. Ensure retry state resets cleanly and does not extend beyond the app’s startup timeout guarantees."
        },
        {
          "path": "frontend/src/hooks/useSafeActor.ts",
          "operation": "modify",
          "description": "Add query invalidation/refetch behavior when the actor instance changes (similar to previous useActor behavior) so dependent queries like the caller profile re-run after an actor is successfully re-created during retries or manual recovery."
        },
        {
          "path": "frontend/src/hooks/useStartupGate.ts",
          "operation": "modify",
          "description": "Adjust the startup gate retry action to represent a full startup re-initialization (actor + profile) by clearing/resetting startup timing state and triggering actor recreation while ensuring profile queries are refreshed once the actor becomes available; keep the flow bounded and never indefinitely loading."
        },
        {
          "path": "frontend/src/components/startup/StartupErrorScreen.tsx",
          "operation": "modify",
          "description": "Ensure the “Retry Connection” action can await an async onRetry (startup re-init) and that repeated clicks cannot leave stale retry/loading UI states; keep all user-facing text in English and preserve existing styling."
        },
        {
          "path": "frontend/src/app/AuthenticatedApp.tsx",
          "operation": "modify",
          "description": "Wire any updated startup-gate retry signature/behavior into the existing startup error screen so Retry Connection performs a full in-app recovery without requiring a full page reload."
        }
      ]
    }
  ]
}