{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Wire Settings Strategy Presets into Journal New Trade Strategy dropdown",
  "requirements": [
    {
      "id": "REQ-15",
      "summary": "Source New Trade Strategy dropdown options exclusively from the authenticated user’s saved Settings strategy presets and preserve legacy strategy values when editing.",
      "acceptanceCriteria": [
        "After saving Settings with strategy presets (e.g., lines: \"Order Block\"), opening Journal → New Trade shows \"Order Block\" as a selectable Strategy option.",
        "The Strategy dropdown in the New Trade form does not display any hardcoded strategies (e.g., no default list like “Structure Break”, “Other”, etc.) when presets exist; it only displays the saved presets.",
        "Editing an existing trade still shows the trade’s saved strategy value selected in the Strategy field, even if it is not currently present in presets (no crash)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/journal/TradeFormDialog.tsx",
          "operation": "modify",
          "description": "Replace the hardcoded Strategy <SelectItem> list with options derived from the user’s saved settings.strategyPresets (via existing useGetSettings hook). Ensure editing mode keeps the trade’s saved strategy selectable/selected even if it is not in current presets (e.g., by injecting the existing value into the rendered options list). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure Settings query/mutation wiring supports immediate UI refresh after Save Settings (e.g., continue invalidating the ['settings'] query on save success and keep cache behavior compatible with the Journal form reading settings)."
        }
      ]
    },
    {
      "id": "REQ-16",
      "summary": "Parse newline-delimited Settings.strategyPresets into a clean, de-duplicated list for the Strategy dropdown.",
      "acceptanceCriteria": [
        "Given a strategy presets textarea value containing blank lines and extra spaces, the New Trade Strategy dropdown shows only non-empty trimmed items.",
        "Duplicate presets do not render duplicate Strategy options in the dropdown."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/strategyPresets.ts",
          "operation": "create",
          "description": "Add a reusable parser utility to convert a newline-delimited strategyPresets string into a clean list: trim each line, drop empty lines, and de-duplicate entries using a single consistent approach across the app (choose and document case-sensitive vs case-insensitive behavior inside the utility)."
        },
        {
          "path": "frontend/src/components/journal/TradeFormDialog.tsx",
          "operation": "modify",
          "description": "Use the shared strategy presets parsing utility to build the Strategy dropdown options from settings.strategyPresets, ensuring whitespace/blank lines are handled and duplicates are not rendered. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Update frontend typing so TradeFormData.strategy supports dynamic preset strings instead of a fixed union.",
      "acceptanceCriteria": [
        "The frontend builds without TypeScript errors after making Strategy presets dynamic.",
        "Saving a trade with a preset strategy stores the selected strategy value into the trade’s entryType field (via existing mapping) and it appears in the Journal table/search as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/domain/types.ts",
          "operation": "modify",
          "description": "Adjust domain typing to support dynamic strategy values (e.g., remove the fixed Strategy string union and allow TradeFormData.strategy to be a string compatible with preset-driven values)."
        },
        {
          "path": "frontend/src/components/journal/TradeFormDialog.tsx",
          "operation": "modify",
          "description": "Update form state initialization and Select onValueChange typing to align with the new dynamic strategy type, while keeping existing save flow and mapping behavior intact. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/domain/mappers.ts",
          "operation": "modify",
          "description": "Confirm the form-to-backend mapping continues to store the chosen strategy string into the Trade.entryType field without relying on hardcoded strategy enums/unions."
        }
      ]
    },
    {
      "id": "REQ-18",
      "summary": "Handle empty strategy presets by disabling Strategy selection in New Trade and guiding the user to add presets in Settings.",
      "acceptanceCriteria": [
        "If the saved strategy preset list is empty, the New Trade form does not offer any Strategy options and indicates the user should add strategies in Settings (user-facing text must be in English).",
        "Users cannot create/add a new strategy from the Journal form; strategies remain managed only via Settings."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/journal/TradeFormDialog.tsx",
          "operation": "modify",
          "description": "Implement an empty-presets state: when parsed presets list is empty, disable the Strategy Select (no options rendered), show English helper text instructing the user to add strategy presets in Settings, and prevent arbitrary strategy entry from the Journal form. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/SettingsPage.tsx",
          "operation": "modify",
          "description": "Remove any hardcoded default strategyPresets initial value from Settings form state so users explicitly manage strategies via Settings; keep the textarea placeholder for guidance and rely on persisted saved settings for actual presets. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}